zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_ENETC_COMMON.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_ENETC_COMMON
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_ENETC_COMMON_H_)  /* Check if memory map has not been already included */
#define S32K566_ENETC_COMMON_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- ENETC_COMMON Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_COMMON_Peripheral_Access_Layer ENETC_COMMON Peripheral Access Layer
 * @{
 */

/** ENETC_COMMON - Size of Registers Arrays */
#define ENETC_COMMON_NUM_PROFILE_COUNT            1u

/** ENETC_COMMON - Register Layout Typedef */
typedef struct ENETC_COMMON_Struct {
  __I  uint32_t IPCAPR;                            /**< Ingress port capability register, offset: 0x0 */
  __I  uint32_t EPCAPR;                            /**< Egress port capability register, offset: 0x4 */
  uint8_t RESERVED_0[8];
  __I  uint32_t OSR;                               /**< Operational state register, offset: 0x10 */
  uint8_t RESERVED_1[8];
  __IO uint32_t NSTCR;                             /**< NS Tag configuration register, offset: 0x1C */
  uint8_t RESERVED_2[16];
  __I  uint32_t MPCR;                              /**< Management port configuration register, offset: 0x30 */
  uint8_t RESERVED_3[12];
  __IO uint32_t CMECR;                             /**< Correctable memory error configuration register, offset: 0x40 */
  __IO uint32_t CMESR;                             /**< Correctable memory error status register, offset: 0x44 */
  uint8_t RESERVED_4[4];
  __I  uint32_t CMECTR;                            /**< Correctable memory error count register, offset: 0x4C */
  uint8_t RESERVED_5[16];
  __IO uint32_t UNMACECR;                          /**< Uncorrectable non-fatal MAC error configuration register, offset: 0x60 */
  __I  uint32_t UNMACESR;                          /**< Uncorrectable non-fatal MAC error status register, offset: 0x64 */
  __IO uint32_t UFMACECR;                          /**< Uncorrectable fatal MAC error configuration register, offset: 0x68 */
  __I  uint32_t UFMACESR;                          /**< Uncorrectable fatal MAC error status register, offset: 0x6C */
  uint8_t RESERVED_6[16];
  __IO uint32_t UFSBECR;                           /**< Uncorrectable fatal system bus error configuration register, offset: 0x80 */
  __IO uint32_t UFSBESR;                           /**< Uncorrectable fatal system bus error status register, offset: 0x84 */
  uint8_t RESERVED_7[8];
  __IO uint32_t UNMECR;                            /**< Uncorrectable non-fatal memory error configuration register, offset: 0x90 */
  __IO uint32_t UNMESR0;                           /**< Uncorrectable non-fatal memory error status register 0, offset: 0x94 */
  __I  uint32_t UNMESR1;                           /**< Uncorrectable non-fatal memory error status register 1, offset: 0x98 */
  __I  uint32_t UNMECTR;                           /**< Uncorrectable non-fatal memory error count register, offset: 0x9C */
  __IO uint32_t UFMECR;                            /**< Uncorrectable fatal memory error configuration register, offset: 0xA0 */
  __IO uint32_t UFMESR0;                           /**< Uncorrectable fatal memory error status register 0, offset: 0xA4 */
  __I  uint32_t UFMESR1;                           /**< Uncorrectable fatal memory error status register 1, offset: 0xA8 */
  uint8_t RESERVED_8[4];
  __IO uint32_t UNIECR;                            /**< Uncorrectable non-fatal integrity error configuration register, offset: 0xB0 */
  __IO uint32_t UNIESR;                            /**< Uncorrectable non-fatal integrity error status register, offset: 0xB4 */
  uint8_t RESERVED_9[4];
  __I  uint32_t UNIECTR;                           /**< Uncorrectable non-fatal integrity error count register, offset: 0xBC */
  __IO uint32_t UFIECR;                            /**< Uncorrectable fatal integrity error configuration register, offset: 0xC0 */
  __IO uint32_t UFIESR;                            /**< Uncorrectable fatal integrity error status register, offset: 0xC4 */
  uint8_t RESERVED_10[312];
  __IO uint32_t CVLANR1;                           /**< Custom VLAN EtherType register 1, offset: 0x200 */
  __IO uint32_t CVLANR2;                           /**< Custom VLAN EtherType register 2, offset: 0x204 */
  uint8_t RESERVED_11[24];
  __IO uint32_t DOSL2CR;                           /**< DoS L2 configuration register, offset: 0x220 */
  __IO uint32_t DOSL3CR;                           /**< DoS L3 configuration register, offset: 0x224 */
  uint8_t RESERVED_12[216];
  struct ENETC_COMMON_NUM_PROFILE {                /* offset: 0x300, array step: 0xC */
    __IO uint32_t VLANIPVMPR0;                       /**< VLAN to IPV mapping profile 0 register 0, array offset: 0x300, array step: 0xC */
    __IO uint32_t VLANIPVMPR1;                       /**< VLAN to IPV mapping profile 0 register 1, array offset: 0x304, array step: 0xC */
    __IO uint32_t VLANDRMPR;                         /**< VLAN to DR mapping profile 0 register, array offset: 0x308, array step: 0xC */
  } NUM_PROFILE[ENETC_COMMON_NUM_PROFILE_COUNT];
  uint8_t RESERVED_13[820];
  __I  uint32_t IPFCAPR;                           /**< Ingress port filter capability register, offset: 0x640 */
  __I  uint32_t IPFTCAPR;                          /**< Ingress port filter table capability register, offset: 0x644 */
  __I  uint32_t IPFTMOR;                           /**< Ingress port filter table memory operational register, offset: 0x648 */
  uint8_t RESERVED_14[436];
  __I  uint32_t ITMCAPR;                           /**< Index table memory capability register, offset: 0x800 */
  uint8_t RESERVED_15[12];
  __I  uint32_t RPCAPR;                            /**< Rate policer capability register, offset: 0x810 */
  __I  uint32_t RPITCAPR;                          /**< Rate policer index table capability register, offset: 0x814 */
  __IO uint32_t RPITMAR;                           /**< Rate policer index table memory allocation register, offset: 0x818 */
  __I  uint32_t RPITOR;                            /**< Rate policer index table operational register, offset: 0x81C */
  uint8_t RESERVED_16[4];
  __I  uint32_t ISCITCAPR;                         /**< Ingress stream counter index table capability register, offset: 0x824 */
  __IO uint32_t ISCITMAR;                          /**< Ingress stream counter index table memory allocation register, offset: 0x828 */
  __I  uint32_t ISCITOR;                           /**< Ingress stream counter index table operational register, offset: 0x82C */
  __I  uint32_t ISCAPR;                            /**< Ingress stream capability register, offset: 0x830 */
  __I  uint32_t ISITCAPR;                          /**< Ingress stream index table capability register, offset: 0x834 */
  __IO uint32_t ISITMAR;                           /**< Ingress stream index table memory allocation register, offset: 0x838 */
  __I  uint32_t ISITOR;                            /**< Ingress stream index table operational register, offset: 0x83C */
  uint8_t RESERVED_17[32];
  __I  uint32_t SGCAPR;                            /**< Stream gate capability register, offset: 0x860 */
  __I  uint32_t SGIITCAPR;                         /**< Stream gate instance index table capability register, offset: 0x864 */
  __IO uint32_t SGIITMAR;                          /**< Stream gate instance index table memory allocation register, offset: 0x868 */
  __I  uint32_t SGIITOR;                           /**< Stream gate instance index table operational register, offset: 0x86C */
  uint8_t RESERVED_18[4];
  __I  uint32_t SGCLITCAPR;                        /**< Stream gate control list index table capability register, offset: 0x874 */
  __IO uint32_t SGCLITMAR;                         /**< Stream gate control list index table memory allocation register, offset: 0x878 */
  __I  uint32_t SGCLTMOR;                          /**< Stream gate control list table memory operational register, offset: 0x87C */
  uint8_t RESERVED_19[84];
  __I  uint32_t TGSTCAPR;                          /**< Time gate scheduling table capability register, offset: 0x8D4 */
  uint8_t RESERVED_20[4];
  __I  uint32_t TGSTMOR;                           /**< Time gate scheduling table memory operation register, offset: 0x8DC */
  uint8_t RESERVED_21[32];
  __I  uint32_t HTMCAPR;                           /**< Hash table memory capability register, offset: 0x900 */
  __I  uint32_t HTMOR;                             /**< Hash table memory operational register, offset: 0x904 */
  uint8_t RESERVED_22[8];
  __I  uint32_t ISIDCAPR;                          /**< Ingress stream identification capability register, offset: 0x910 */
  __I  uint32_t ISIDHTCAPR;                        /**< Ingress stream identification hash table capability register, offset: 0x914 */
  uint8_t RESERVED_23[8];
  __I  uint32_t ISIDKC0OR;                         /**< Ingress stream identification key construction 0 operational register, offset: 0x920 */
  __IO uint32_t ISIDKC0CR0;                        /**< Ingress stream identification key construction 0 configuration register 0, offset: 0x924 */
  uint8_t RESERVED_24[8];
  __IO uint32_t ISIDKC0PF0CR;                      /**< Ingress stream identification key construction 0 payload field 0 configuration register, offset: 0x930 */
  __IO uint32_t ISIDKC0PF1CR;                      /**< Ingress stream identification key construction 0 payload field 1 configuration register, offset: 0x934 */
  __IO uint32_t ISIDKC0PF2CR;                      /**< Ingress stream identification key construction 0 payload field 2 configuration register, offset: 0x938 */
  __IO uint32_t ISIDKC0PF3CR;                      /**< Ingress stream identification key construction 0 payload field 3 configuration register, offset: 0x93C */
  __I  uint32_t ISIDKC1OR;                         /**< Ingress stream identification key construction 1 operational register, offset: 0x940 */
  __IO uint32_t ISIDKC1CR0;                        /**< Ingress stream identification key construction 1 configuration register 0, offset: 0x944 */
  uint8_t RESERVED_25[8];
  __IO uint32_t ISIDKC1PF0CR;                      /**< Ingress stream identification key construction 1 payload field 0 configuration register, offset: 0x950 */
  __IO uint32_t ISIDKC1PF1CR;                      /**< Ingress stream identification key construction 1 payload field 1 configuration register, offset: 0x954 */
  __IO uint32_t ISIDKC1PF2CR;                      /**< Ingress stream identification key construction 1 payload field 2 configuration register, offset: 0x958 */
  __IO uint32_t ISIDKC1PF3CR;                      /**< Ingress stream identification key construction 1 payload field 3 configuration register, offset: 0x95C */
  uint8_t RESERVED_26[160];
  __I  uint32_t ISFHTCAPR;                         /**< Ingress stream filter hash table capability register, offset: 0xA00 */
  __I  uint32_t ISFHTOR;                           /**< Ingress stream filter hash table operational register, offset: 0xA04 */
} ENETC_COMMON_Type, *ENETC_COMMON_MemMapPtr;

/** Number of instances of the ENETC_COMMON module. */
#define ENETC_COMMON_INSTANCE_COUNT              (1u)

