zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
/* ENETC_COMMON - Peripheral instance base addresses */
/** Peripheral NETC__ENETC0_COMMON base address */
#define IP_NETC__ENETC0_COMMON_BASE              (0x6D091000u)
/** Peripheral NETC__ENETC0_COMMON base pointer */
#define IP_NETC__ENETC0_COMMON                   ((ENETC_COMMON_Type *)IP_NETC__ENETC0_COMMON_BASE)
/** Array initializer of ENETC_COMMON peripheral base addresses */
#define IP_ENETC_COMMON_BASE_ADDRS               { IP_NETC__ENETC0_COMMON_BASE }
/** Array initializer of ENETC_COMMON peripheral base pointers */
#define IP_ENETC_COMMON_BASE_PTRS                { IP_NETC__ENETC0_COMMON }

/* ----------------------------------------------------------------------------
   -- ENETC_COMMON Register Masks
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup ENETC_COMMON_Register_Masks ENETC_COMMON Register Masks
 * @{
 */

/*! @name IPCAPR - Ingress port capability register */
/*! @{ */

#define ENETC_COMMON_IPCAPR_RP_MASK              (0x1U)
#define ENETC_COMMON_IPCAPR_RP_SHIFT             (0U)
#define ENETC_COMMON_IPCAPR_RP_WIDTH             (1U)
#define ENETC_COMMON_IPCAPR_RP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPCAPR_RP_SHIFT)) & ENETC_COMMON_IPCAPR_RP_MASK)

#define ENETC_COMMON_IPCAPR_IPFLT_MASK           (0x2U)
#define ENETC_COMMON_IPCAPR_IPFLT_SHIFT          (1U)
#define ENETC_COMMON_IPCAPR_IPFLT_WIDTH          (1U)
#define ENETC_COMMON_IPCAPR_IPFLT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPCAPR_IPFLT_SHIFT)) & ENETC_COMMON_IPCAPR_IPFLT_MASK)

#define ENETC_COMMON_IPCAPR_ISID_MASK            (0x4U)
#define ENETC_COMMON_IPCAPR_ISID_SHIFT           (2U)
#define ENETC_COMMON_IPCAPR_ISID_WIDTH           (1U)
#define ENETC_COMMON_IPCAPR_ISID(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPCAPR_ISID_SHIFT)) & ENETC_COMMON_IPCAPR_ISID_MASK)

#define ENETC_COMMON_IPCAPR_SDU_MASK             (0x1F00U)
#define ENETC_COMMON_IPCAPR_SDU_SHIFT            (8U)
#define ENETC_COMMON_IPCAPR_SDU_WIDTH            (5U)
#define ENETC_COMMON_IPCAPR_SDU(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPCAPR_SDU_SHIFT)) & ENETC_COMMON_IPCAPR_SDU_MASK)

#define ENETC_COMMON_IPCAPR_NUM_VQMP_MASK        (0xF0000U)
#define ENETC_COMMON_IPCAPR_NUM_VQMP_SHIFT       (16U)
#define ENETC_COMMON_IPCAPR_NUM_VQMP_WIDTH       (4U)
#define ENETC_COMMON_IPCAPR_NUM_VQMP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPCAPR_NUM_VQMP_SHIFT)) & ENETC_COMMON_IPCAPR_NUM_VQMP_MASK)
/*! @} */

/*! @name EPCAPR - Egress port capability register */
/*! @{ */

#define ENETC_COMMON_EPCAPR_SDU_MASK             (0x1F00U)
#define ENETC_COMMON_EPCAPR_SDU_SHIFT            (8U)
#define ENETC_COMMON_EPCAPR_SDU_WIDTH            (5U)
#define ENETC_COMMON_EPCAPR_SDU(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_EPCAPR_SDU_SHIFT)) & ENETC_COMMON_EPCAPR_SDU_MASK)

#define ENETC_COMMON_EPCAPR_NUM_QVMP_MASK        (0xF0000U)
#define ENETC_COMMON_EPCAPR_NUM_QVMP_SHIFT       (16U)
#define ENETC_COMMON_EPCAPR_NUM_QVMP_WIDTH       (4U)
#define ENETC_COMMON_EPCAPR_NUM_QVMP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_EPCAPR_NUM_QVMP_SHIFT)) & ENETC_COMMON_EPCAPR_NUM_QVMP_MASK)
/*! @} */

/*! @name OSR - Operational state register */
/*! @{ */

#define ENETC_COMMON_OSR_STATE_MASK              (0x1U)
#define ENETC_COMMON_OSR_STATE_SHIFT             (0U)
#define ENETC_COMMON_OSR_STATE_WIDTH             (1U)
#define ENETC_COMMON_OSR_STATE(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_OSR_STATE_SHIFT)) & ENETC_COMMON_OSR_STATE_MASK)

#define ENETC_COMMON_OSR_ITM_STATE_MASK          (0x2U)
#define ENETC_COMMON_OSR_ITM_STATE_SHIFT         (1U)
#define ENETC_COMMON_OSR_ITM_STATE_WIDTH         (1U)
#define ENETC_COMMON_OSR_ITM_STATE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_OSR_ITM_STATE_SHIFT)) & ENETC_COMMON_OSR_ITM_STATE_MASK)
/*! @} */

/*! @name NSTCR - NS Tag configuration register */
/*! @{ */

#define ENETC_COMMON_NSTCR_ETHERTYPE_MASK        (0xFFFFU)
#define ENETC_COMMON_NSTCR_ETHERTYPE_SHIFT       (0U)
#define ENETC_COMMON_NSTCR_ETHERTYPE_WIDTH       (16U)
#define ENETC_COMMON_NSTCR_ETHERTYPE(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_NSTCR_ETHERTYPE_SHIFT)) & ENETC_COMMON_NSTCR_ETHERTYPE_MASK)
/*! @} */

/*! @name MPCR - Management port configuration register */
/*! @{ */

#define ENETC_COMMON_MPCR_PORT_MASK              (0x1FU)
#define ENETC_COMMON_MPCR_PORT_SHIFT             (0U)
#define ENETC_COMMON_MPCR_PORT_WIDTH             (5U)
#define ENETC_COMMON_MPCR_PORT(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_MPCR_PORT_SHIFT)) & ENETC_COMMON_MPCR_PORT_MASK)

#define ENETC_COMMON_MPCR_SWID_MASK              (0xE0U)
#define ENETC_COMMON_MPCR_SWID_SHIFT             (5U)
#define ENETC_COMMON_MPCR_SWID_WIDTH             (3U)
#define ENETC_COMMON_MPCR_SWID(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_MPCR_SWID_SHIFT)) & ENETC_COMMON_MPCR_SWID_MASK)
/*! @} */

/*! @name CMECR - Correctable memory error configuration register */
/*! @{ */

#define ENETC_COMMON_CMECR_THRESHOLD_MASK        (0xFFU)
#define ENETC_COMMON_CMECR_THRESHOLD_SHIFT       (0U)
#define ENETC_COMMON_CMECR_THRESHOLD_WIDTH       (8U)
#define ENETC_COMMON_CMECR_THRESHOLD(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CMECR_THRESHOLD_SHIFT)) & ENETC_COMMON_CMECR_THRESHOLD_MASK)
/*! @} */

/*! @name CMESR - Correctable memory error status register */
/*! @{ */

#define ENETC_COMMON_CMESR_LINK_SLICE_ID_MASK    (0x1FU)
#define ENETC_COMMON_CMESR_LINK_SLICE_ID_SHIFT   (0U)
#define ENETC_COMMON_CMESR_LINK_SLICE_ID_WIDTH   (5U)
#define ENETC_COMMON_CMESR_LINK_SLICE_ID(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CMESR_LINK_SLICE_ID_SHIFT)) & ENETC_COMMON_CMESR_LINK_SLICE_ID_MASK)

#define ENETC_COMMON_CMESR_MEM_ID_MASK           (0x1F00U)
#define ENETC_COMMON_CMESR_MEM_ID_SHIFT          (8U)
#define ENETC_COMMON_CMESR_MEM_ID_WIDTH          (5U)
#define ENETC_COMMON_CMESR_MEM_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CMESR_MEM_ID_SHIFT)) & ENETC_COMMON_CMESR_MEM_ID_MASK)

#define ENETC_COMMON_CMESR_SBEE_MASK             (0x80000000U)
#define ENETC_COMMON_CMESR_SBEE_SHIFT            (31U)
#define ENETC_COMMON_CMESR_SBEE_WIDTH            (1U)
#define ENETC_COMMON_CMESR_SBEE(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CMESR_SBEE_SHIFT)) & ENETC_COMMON_CMESR_SBEE_MASK)
/*! @} */

/*! @name CMECTR - Correctable memory error count register */
/*! @{ */

