zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_CMECTR_COUNT_MASK           (0xFFU)
#define ENETC_COMMON_CMECTR_COUNT_SHIFT          (0U)
#define ENETC_COMMON_CMECTR_COUNT_WIDTH          (8U)
#define ENETC_COMMON_CMECTR_COUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CMECTR_COUNT_SHIFT)) & ENETC_COMMON_CMECTR_COUNT_MASK)
/*! @} */

/*! @name UNMACECR - Uncorrectable non-fatal MAC error configuration register */
/*! @{ */

#define ENETC_COMMON_UNMACECR_PORT0_MASK         (0x1U)
#define ENETC_COMMON_UNMACECR_PORT0_SHIFT        (0U)
#define ENETC_COMMON_UNMACECR_PORT0_WIDTH        (1U)
#define ENETC_COMMON_UNMACECR_PORT0(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMACECR_PORT0_SHIFT)) & ENETC_COMMON_UNMACECR_PORT0_MASK)
/*! @} */

/*! @name UNMACESR - Uncorrectable non-fatal MAC error status register */
/*! @{ */

#define ENETC_COMMON_UNMACESR_PORT0_MASK         (0x1U)
#define ENETC_COMMON_UNMACESR_PORT0_SHIFT        (0U)
#define ENETC_COMMON_UNMACESR_PORT0_WIDTH        (1U)
#define ENETC_COMMON_UNMACESR_PORT0(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMACESR_PORT0_SHIFT)) & ENETC_COMMON_UNMACESR_PORT0_MASK)
/*! @} */

/*! @name UFMACECR - Uncorrectable fatal MAC error configuration register */
/*! @{ */

#define ENETC_COMMON_UFMACECR_PORT0_MASK         (0x1U)
#define ENETC_COMMON_UFMACECR_PORT0_SHIFT        (0U)
#define ENETC_COMMON_UFMACECR_PORT0_WIDTH        (1U)
#define ENETC_COMMON_UFMACECR_PORT0(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMACECR_PORT0_SHIFT)) & ENETC_COMMON_UFMACECR_PORT0_MASK)
/*! @} */

/*! @name UFMACESR - Uncorrectable fatal MAC error status register */
/*! @{ */

#define ENETC_COMMON_UFMACESR_PORT0_MASK         (0x1U)
#define ENETC_COMMON_UFMACESR_PORT0_SHIFT        (0U)
#define ENETC_COMMON_UFMACESR_PORT0_WIDTH        (1U)
#define ENETC_COMMON_UFMACESR_PORT0(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMACESR_PORT0_SHIFT)) & ENETC_COMMON_UFMACESR_PORT0_MASK)
/*! @} */

/*! @name UFSBECR - Uncorrectable fatal system bus error configuration register */
/*! @{ */

#define ENETC_COMMON_UFSBECR_RD_MASK             (0x80000000U)
#define ENETC_COMMON_UFSBECR_RD_SHIFT            (31U)
#define ENETC_COMMON_UFSBECR_RD_WIDTH            (1U)
#define ENETC_COMMON_UFSBECR_RD(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFSBECR_RD_SHIFT)) & ENETC_COMMON_UFSBECR_RD_MASK)
/*! @} */

/*! @name UFSBESR - Uncorrectable fatal system bus error status register */
/*! @{ */

#define ENETC_COMMON_UFSBESR_SB_ID_MASK          (0xF00U)
#define ENETC_COMMON_UFSBESR_SB_ID_SHIFT         (8U)
#define ENETC_COMMON_UFSBESR_SB_ID_WIDTH         (4U)
#define ENETC_COMMON_UFSBESR_SB_ID(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFSBESR_SB_ID_SHIFT)) & ENETC_COMMON_UFSBESR_SB_ID_MASK)

#define ENETC_COMMON_UFSBESR_M_MASK              (0x40000000U)
#define ENETC_COMMON_UFSBESR_M_SHIFT             (30U)
#define ENETC_COMMON_UFSBESR_M_WIDTH             (1U)
#define ENETC_COMMON_UFSBESR_M(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFSBESR_M_SHIFT)) & ENETC_COMMON_UFSBESR_M_MASK)

#define ENETC_COMMON_UFSBESR_SBE_MASK            (0x80000000U)
#define ENETC_COMMON_UFSBESR_SBE_SHIFT           (31U)
#define ENETC_COMMON_UFSBESR_SBE_WIDTH           (1U)
#define ENETC_COMMON_UFSBESR_SBE(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFSBESR_SBE_SHIFT)) & ENETC_COMMON_UFSBESR_SBE_MASK)
/*! @} */

/*! @name UNMECR - Uncorrectable non-fatal memory error configuration register */
/*! @{ */

#define ENETC_COMMON_UNMECR_THRESHOLD_MASK       (0xFFU)
#define ENETC_COMMON_UNMECR_THRESHOLD_SHIFT      (0U)
#define ENETC_COMMON_UNMECR_THRESHOLD_WIDTH      (8U)
#define ENETC_COMMON_UNMECR_THRESHOLD(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMECR_THRESHOLD_SHIFT)) & ENETC_COMMON_UNMECR_THRESHOLD_MASK)

#define ENETC_COMMON_UNMECR_RD_MASK              (0x80000000U)
#define ENETC_COMMON_UNMECR_RD_SHIFT             (31U)
#define ENETC_COMMON_UNMECR_RD_WIDTH             (1U)
#define ENETC_COMMON_UNMECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMECR_RD_SHIFT)) & ENETC_COMMON_UNMECR_RD_MASK)
/*! @} */

/*! @name UNMESR0 - Uncorrectable non-fatal memory error status register 0 */
/*! @{ */

#define ENETC_COMMON_UNMESR0_LINK_SLICE_ID_MASK  (0x1FU)
#define ENETC_COMMON_UNMESR0_LINK_SLICE_ID_SHIFT (0U)
#define ENETC_COMMON_UNMESR0_LINK_SLICE_ID_WIDTH (5U)
#define ENETC_COMMON_UNMESR0_LINK_SLICE_ID(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMESR0_LINK_SLICE_ID_SHIFT)) & ENETC_COMMON_UNMESR0_LINK_SLICE_ID_MASK)

#define ENETC_COMMON_UNMESR0_MEM_ID_MASK         (0x1F00U)
#define ENETC_COMMON_UNMESR0_MEM_ID_SHIFT        (8U)
#define ENETC_COMMON_UNMESR0_MEM_ID_WIDTH        (5U)
#define ENETC_COMMON_UNMESR0_MEM_ID(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMESR0_MEM_ID_SHIFT)) & ENETC_COMMON_UNMESR0_MEM_ID_MASK)

#define ENETC_COMMON_UNMESR0_SYNDROME_MASK       (0x7FF0000U)
#define ENETC_COMMON_UNMESR0_SYNDROME_SHIFT      (16U)
#define ENETC_COMMON_UNMESR0_SYNDROME_WIDTH      (11U)
#define ENETC_COMMON_UNMESR0_SYNDROME(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMESR0_SYNDROME_SHIFT)) & ENETC_COMMON_UNMESR0_SYNDROME_MASK)

#define ENETC_COMMON_UNMESR0_MBEE_MASK           (0x80000000U)
#define ENETC_COMMON_UNMESR0_MBEE_SHIFT          (31U)
#define ENETC_COMMON_UNMESR0_MBEE_WIDTH          (1U)
#define ENETC_COMMON_UNMESR0_MBEE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMESR0_MBEE_SHIFT)) & ENETC_COMMON_UNMESR0_MBEE_MASK)
/*! @} */

/*! @name UNMESR1 - Uncorrectable non-fatal memory error status register 1 */
/*! @{ */

#define ENETC_COMMON_UNMESR1_ADDR_MASK           (0xFFFFFFFFU)
#define ENETC_COMMON_UNMESR1_ADDR_SHIFT          (0U)
#define ENETC_COMMON_UNMESR1_ADDR_WIDTH          (32U)
#define ENETC_COMMON_UNMESR1_ADDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMESR1_ADDR_SHIFT)) & ENETC_COMMON_UNMESR1_ADDR_MASK)
/*! @} */

/*! @name UNMECTR - Uncorrectable non-fatal memory error count register */
/*! @{ */

#define ENETC_COMMON_UNMECTR_COUNT_MASK          (0xFFU)
#define ENETC_COMMON_UNMECTR_COUNT_SHIFT         (0U)
#define ENETC_COMMON_UNMECTR_COUNT_WIDTH         (8U)
#define ENETC_COMMON_UNMECTR_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNMECTR_COUNT_SHIFT)) & ENETC_COMMON_UNMECTR_COUNT_MASK)
/*! @} */

/*! @name UFMECR - Uncorrectable fatal memory error configuration register */
/*! @{ */

#define ENETC_COMMON_UFMECR_RD_MASK              (0x80000000U)
#define ENETC_COMMON_UFMECR_RD_SHIFT             (31U)
#define ENETC_COMMON_UFMECR_RD_WIDTH             (1U)
#define ENETC_COMMON_UFMECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMECR_RD_SHIFT)) & ENETC_COMMON_UFMECR_RD_MASK)
/*! @} */

/*! @name UFMESR0 - Uncorrectable fatal memory error status register 0 */
/*! @{ */

