zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_UFMESR0_LINK_SLICE_ID_MASK  (0x1FU)
#define ENETC_COMMON_UFMESR0_LINK_SLICE_ID_SHIFT (0U)
#define ENETC_COMMON_UFMESR0_LINK_SLICE_ID_WIDTH (5U)
#define ENETC_COMMON_UFMESR0_LINK_SLICE_ID(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR0_LINK_SLICE_ID_SHIFT)) & ENETC_COMMON_UFMESR0_LINK_SLICE_ID_MASK)

#define ENETC_COMMON_UFMESR0_MEM_ID_MASK         (0x1F00U)
#define ENETC_COMMON_UFMESR0_MEM_ID_SHIFT        (8U)
#define ENETC_COMMON_UFMESR0_MEM_ID_WIDTH        (5U)
#define ENETC_COMMON_UFMESR0_MEM_ID(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR0_MEM_ID_SHIFT)) & ENETC_COMMON_UFMESR0_MEM_ID_MASK)

#define ENETC_COMMON_UFMESR0_EDCE_MASK           (0x8000U)
#define ENETC_COMMON_UFMESR0_EDCE_SHIFT          (15U)
#define ENETC_COMMON_UFMESR0_EDCE_WIDTH          (1U)
#define ENETC_COMMON_UFMESR0_EDCE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR0_EDCE_SHIFT)) & ENETC_COMMON_UFMESR0_EDCE_MASK)

#define ENETC_COMMON_UFMESR0_SYNDROME_MASK       (0x7FF0000U)
#define ENETC_COMMON_UFMESR0_SYNDROME_SHIFT      (16U)
#define ENETC_COMMON_UFMESR0_SYNDROME_WIDTH      (11U)
#define ENETC_COMMON_UFMESR0_SYNDROME(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR0_SYNDROME_SHIFT)) & ENETC_COMMON_UFMESR0_SYNDROME_MASK)

#define ENETC_COMMON_UFMESR0_M_MASK              (0x40000000U)
#define ENETC_COMMON_UFMESR0_M_SHIFT             (30U)
#define ENETC_COMMON_UFMESR0_M_WIDTH             (1U)
#define ENETC_COMMON_UFMESR0_M(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR0_M_SHIFT)) & ENETC_COMMON_UFMESR0_M_MASK)

#define ENETC_COMMON_UFMESR0_MBEE_MASK           (0x80000000U)
#define ENETC_COMMON_UFMESR0_MBEE_SHIFT          (31U)
#define ENETC_COMMON_UFMESR0_MBEE_WIDTH          (1U)
#define ENETC_COMMON_UFMESR0_MBEE(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR0_MBEE_SHIFT)) & ENETC_COMMON_UFMESR0_MBEE_MASK)
/*! @} */

/*! @name UFMESR1 - Uncorrectable fatal memory error status register 1 */
/*! @{ */

#define ENETC_COMMON_UFMESR1_ADDR_MASK           (0xFFFFFFFFU)
#define ENETC_COMMON_UFMESR1_ADDR_SHIFT          (0U)
#define ENETC_COMMON_UFMESR1_ADDR_WIDTH          (32U)
#define ENETC_COMMON_UFMESR1_ADDR(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFMESR1_ADDR_SHIFT)) & ENETC_COMMON_UFMESR1_ADDR_MASK)
/*! @} */

/*! @name UNIECR - Uncorrectable non-fatal integrity error configuration register */
/*! @{ */

#define ENETC_COMMON_UNIECR_THRESHOLD_MASK       (0xFFU)
#define ENETC_COMMON_UNIECR_THRESHOLD_SHIFT      (0U)
#define ENETC_COMMON_UNIECR_THRESHOLD_WIDTH      (8U)
#define ENETC_COMMON_UNIECR_THRESHOLD(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIECR_THRESHOLD_SHIFT)) & ENETC_COMMON_UNIECR_THRESHOLD_MASK)

#define ENETC_COMMON_UNIECR_RD_MASK              (0x80000000U)
#define ENETC_COMMON_UNIECR_RD_SHIFT             (31U)
#define ENETC_COMMON_UNIECR_RD_WIDTH             (1U)
#define ENETC_COMMON_UNIECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIECR_RD_SHIFT)) & ENETC_COMMON_UNIECR_RD_MASK)
/*! @} */

/*! @name UNIESR - Uncorrectable non-fatal integrity error status register */
/*! @{ */

#define ENETC_COMMON_UNIESR_LINK_SLICE_ID_MASK   (0x1FU)
#define ENETC_COMMON_UNIESR_LINK_SLICE_ID_SHIFT  (0U)
#define ENETC_COMMON_UNIESR_LINK_SLICE_ID_WIDTH  (5U)
#define ENETC_COMMON_UNIESR_LINK_SLICE_ID(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIESR_LINK_SLICE_ID_SHIFT)) & ENETC_COMMON_UNIESR_LINK_SLICE_ID_MASK)

#define ENETC_COMMON_UNIESR_BLOCK_ID_MASK        (0x1F00U)
#define ENETC_COMMON_UNIESR_BLOCK_ID_SHIFT       (8U)
#define ENETC_COMMON_UNIESR_BLOCK_ID_WIDTH       (5U)
#define ENETC_COMMON_UNIESR_BLOCK_ID(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIESR_BLOCK_ID_SHIFT)) & ENETC_COMMON_UNIESR_BLOCK_ID_MASK)

#define ENETC_COMMON_UNIESR_SM_ID_MASK           (0x3F0000U)
#define ENETC_COMMON_UNIESR_SM_ID_SHIFT          (16U)
#define ENETC_COMMON_UNIESR_SM_ID_WIDTH          (6U)
#define ENETC_COMMON_UNIESR_SM_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIESR_SM_ID_SHIFT)) & ENETC_COMMON_UNIESR_SM_ID_MASK)

#define ENETC_COMMON_UNIESR_ENGINE_ID_MASK       (0x1000000U)
#define ENETC_COMMON_UNIESR_ENGINE_ID_SHIFT      (24U)
#define ENETC_COMMON_UNIESR_ENGINE_ID_WIDTH      (1U)
#define ENETC_COMMON_UNIESR_ENGINE_ID(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIESR_ENGINE_ID_SHIFT)) & ENETC_COMMON_UNIESR_ENGINE_ID_MASK)

#define ENETC_COMMON_UNIESR_INTERR_MASK          (0x80000000U)
#define ENETC_COMMON_UNIESR_INTERR_SHIFT         (31U)
#define ENETC_COMMON_UNIESR_INTERR_WIDTH         (1U)
#define ENETC_COMMON_UNIESR_INTERR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIESR_INTERR_SHIFT)) & ENETC_COMMON_UNIESR_INTERR_MASK)
/*! @} */

/*! @name UNIECTR - Uncorrectable non-fatal integrity error count register */
/*! @{ */

#define ENETC_COMMON_UNIECTR_COUNT_MASK          (0xFFU)
#define ENETC_COMMON_UNIECTR_COUNT_SHIFT         (0U)
#define ENETC_COMMON_UNIECTR_COUNT_WIDTH         (8U)
#define ENETC_COMMON_UNIECTR_COUNT(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UNIECTR_COUNT_SHIFT)) & ENETC_COMMON_UNIECTR_COUNT_MASK)
/*! @} */

/*! @name UFIECR - Uncorrectable fatal integrity error configuration register */
/*! @{ */

#define ENETC_COMMON_UFIECR_RD_MASK              (0x80000000U)
#define ENETC_COMMON_UFIECR_RD_SHIFT             (31U)
#define ENETC_COMMON_UFIECR_RD_WIDTH             (1U)
#define ENETC_COMMON_UFIECR_RD(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIECR_RD_SHIFT)) & ENETC_COMMON_UFIECR_RD_MASK)
/*! @} */

/*! @name UFIESR - Uncorrectable fatal integrity error status register */
/*! @{ */

#define ENETC_COMMON_UFIESR_LINK_SLICE_ID_MASK   (0x1FU)
#define ENETC_COMMON_UFIESR_LINK_SLICE_ID_SHIFT  (0U)
#define ENETC_COMMON_UFIESR_LINK_SLICE_ID_WIDTH  (5U)
#define ENETC_COMMON_UFIESR_LINK_SLICE_ID(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIESR_LINK_SLICE_ID_SHIFT)) & ENETC_COMMON_UFIESR_LINK_SLICE_ID_MASK)

#define ENETC_COMMON_UFIESR_BLOCK_ID_MASK        (0x1F00U)
#define ENETC_COMMON_UFIESR_BLOCK_ID_SHIFT       (8U)
#define ENETC_COMMON_UFIESR_BLOCK_ID_WIDTH       (5U)
#define ENETC_COMMON_UFIESR_BLOCK_ID(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIESR_BLOCK_ID_SHIFT)) & ENETC_COMMON_UFIESR_BLOCK_ID_MASK)

#define ENETC_COMMON_UFIESR_SM_ID_MASK           (0x3F0000U)
#define ENETC_COMMON_UFIESR_SM_ID_SHIFT          (16U)
#define ENETC_COMMON_UFIESR_SM_ID_WIDTH          (6U)
#define ENETC_COMMON_UFIESR_SM_ID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIESR_SM_ID_SHIFT)) & ENETC_COMMON_UFIESR_SM_ID_MASK)

#define ENETC_COMMON_UFIESR_ENGINE_ID_MASK       (0x1000000U)
#define ENETC_COMMON_UFIESR_ENGINE_ID_SHIFT      (24U)
#define ENETC_COMMON_UFIESR_ENGINE_ID_WIDTH      (1U)
#define ENETC_COMMON_UFIESR_ENGINE_ID(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIESR_ENGINE_ID_SHIFT)) & ENETC_COMMON_UFIESR_ENGINE_ID_MASK)

#define ENETC_COMMON_UFIESR_M_MASK               (0x40000000U)
#define ENETC_COMMON_UFIESR_M_SHIFT              (30U)
#define ENETC_COMMON_UFIESR_M_WIDTH              (1U)
#define ENETC_COMMON_UFIESR_M(x)                 (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIESR_M_SHIFT)) & ENETC_COMMON_UFIESR_M_MASK)

#define ENETC_COMMON_UFIESR_INTERR_MASK          (0x80000000U)
#define ENETC_COMMON_UFIESR_INTERR_SHIFT         (31U)
#define ENETC_COMMON_UFIESR_INTERR_WIDTH         (1U)
#define ENETC_COMMON_UFIESR_INTERR(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_UFIESR_INTERR_SHIFT)) & ENETC_COMMON_UFIESR_INTERR_MASK)
/*! @} */

/*! @name CVLANR1 - Custom VLAN EtherType register 1 */
/*! @{ */

#define ENETC_COMMON_CVLANR1_ETYPE_MASK          (0xFFFFU)
#define ENETC_COMMON_CVLANR1_ETYPE_SHIFT         (0U)
#define ENETC_COMMON_CVLANR1_ETYPE_WIDTH         (16U)
#define ENETC_COMMON_CVLANR1_ETYPE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CVLANR1_ETYPE_SHIFT)) & ENETC_COMMON_CVLANR1_ETYPE_MASK)

