zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_CVLANR1_V_MASK              (0x80000000U)
#define ENETC_COMMON_CVLANR1_V_SHIFT             (31U)
#define ENETC_COMMON_CVLANR1_V_WIDTH             (1U)
#define ENETC_COMMON_CVLANR1_V(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CVLANR1_V_SHIFT)) & ENETC_COMMON_CVLANR1_V_MASK)
/*! @} */

/*! @name CVLANR2 - Custom VLAN EtherType register 2 */
/*! @{ */

#define ENETC_COMMON_CVLANR2_ETYPE_MASK          (0xFFFFU)
#define ENETC_COMMON_CVLANR2_ETYPE_SHIFT         (0U)
#define ENETC_COMMON_CVLANR2_ETYPE_WIDTH         (16U)
#define ENETC_COMMON_CVLANR2_ETYPE(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CVLANR2_ETYPE_SHIFT)) & ENETC_COMMON_CVLANR2_ETYPE_MASK)

#define ENETC_COMMON_CVLANR2_V_MASK              (0x80000000U)
#define ENETC_COMMON_CVLANR2_V_SHIFT             (31U)
#define ENETC_COMMON_CVLANR2_V_WIDTH             (1U)
#define ENETC_COMMON_CVLANR2_V(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_CVLANR2_V_SHIFT)) & ENETC_COMMON_CVLANR2_V_MASK)
/*! @} */

/*! @name DOSL2CR - DoS L2 configuration register */
/*! @{ */

#define ENETC_COMMON_DOSL2CR_SAMEADDR_MASK       (0x1U)
#define ENETC_COMMON_DOSL2CR_SAMEADDR_SHIFT      (0U)
#define ENETC_COMMON_DOSL2CR_SAMEADDR_WIDTH      (1U)
#define ENETC_COMMON_DOSL2CR_SAMEADDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_DOSL2CR_SAMEADDR_SHIFT)) & ENETC_COMMON_DOSL2CR_SAMEADDR_MASK)

#define ENETC_COMMON_DOSL2CR_MSAMCC_MASK         (0x2U)
#define ENETC_COMMON_DOSL2CR_MSAMCC_SHIFT        (1U)
#define ENETC_COMMON_DOSL2CR_MSAMCC_WIDTH        (1U)
#define ENETC_COMMON_DOSL2CR_MSAMCC(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_DOSL2CR_MSAMCC_SHIFT)) & ENETC_COMMON_DOSL2CR_MSAMCC_MASK)
/*! @} */

/*! @name DOSL3CR - DoS L3 configuration register */
/*! @{ */

#define ENETC_COMMON_DOSL3CR_SAMEADDR_MASK       (0x1U)
#define ENETC_COMMON_DOSL3CR_SAMEADDR_SHIFT      (0U)
#define ENETC_COMMON_DOSL3CR_SAMEADDR_WIDTH      (1U)
#define ENETC_COMMON_DOSL3CR_SAMEADDR(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_DOSL3CR_SAMEADDR_SHIFT)) & ENETC_COMMON_DOSL3CR_SAMEADDR_MASK)

#define ENETC_COMMON_DOSL3CR_IPSAMCC_MASK        (0x2U)
#define ENETC_COMMON_DOSL3CR_IPSAMCC_SHIFT       (1U)
#define ENETC_COMMON_DOSL3CR_IPSAMCC_WIDTH       (1U)
#define ENETC_COMMON_DOSL3CR_IPSAMCC(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_DOSL3CR_IPSAMCC_SHIFT)) & ENETC_COMMON_DOSL3CR_IPSAMCC_MASK)
/*! @} */

/*! @name VLANIPVMPR0 - VLAN to IPV mapping profile 0 register 0 */
/*! @{ */

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_0_MASK  (0x7U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_0_SHIFT (0U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_0_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_0(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_0_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_0_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_1_MASK  (0x70U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_1_SHIFT (4U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_1_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_1(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_1_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_1_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_2_MASK  (0x700U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_2_SHIFT (8U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_2_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_2(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_2_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_2_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_3_MASK  (0x7000U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_3_SHIFT (12U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_3_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_3(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_3_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_3_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_4_MASK  (0x70000U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_4_SHIFT (16U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_4_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_4(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_4_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_4_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_5_MASK  (0x700000U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_5_SHIFT (20U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_5_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_5(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_5_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_5_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_6_MASK  (0x7000000U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_6_SHIFT (24U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_6_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_6(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_6_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_6_MASK)

#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_7_MASK  (0x70000000U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_7_SHIFT (28U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_7_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR0_PCP_DEI_7(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR0_PCP_DEI_7_SHIFT)) & ENETC_COMMON_VLANIPVMPR0_PCP_DEI_7_MASK)
/*! @} */

/*! @name VLANIPVMPR1 - VLAN to IPV mapping profile 0 register 1 */
/*! @{ */

#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_8_MASK  (0x7U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_8_SHIFT (0U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_8_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_8(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR1_PCP_DEI_8_SHIFT)) & ENETC_COMMON_VLANIPVMPR1_PCP_DEI_8_MASK)

#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_9_MASK  (0x70U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_9_SHIFT (4U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_9_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_9(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR1_PCP_DEI_9_SHIFT)) & ENETC_COMMON_VLANIPVMPR1_PCP_DEI_9_MASK)

#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_10_MASK (0x700U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_10_SHIFT (8U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_10_WIDTH (3U)
#define ENETC_COMMON_VLANIPVMPR1_PCP_DEI_10(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANIPVMPR1_PCP_DEI_10_SHIFT)) & ENETC_COMMON_VLANIPVMPR1_PCP_DEI_10_MASK)

