zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_13_MASK   (0xC000000U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_13_SHIFT  (26U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_13_WIDTH  (2U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_13(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANDRMPR_PCP_DEI_13_SHIFT)) & ENETC_COMMON_VLANDRMPR_PCP_DEI_13_MASK)

#define ENETC_COMMON_VLANDRMPR_PCP_DEI_14_MASK   (0x30000000U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_14_SHIFT  (28U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_14_WIDTH  (2U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_14(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANDRMPR_PCP_DEI_14_SHIFT)) & ENETC_COMMON_VLANDRMPR_PCP_DEI_14_MASK)

#define ENETC_COMMON_VLANDRMPR_PCP_DEI_15_MASK   (0xC0000000U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_15_SHIFT  (30U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_15_WIDTH  (2U)
#define ENETC_COMMON_VLANDRMPR_PCP_DEI_15(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_VLANDRMPR_PCP_DEI_15_SHIFT)) & ENETC_COMMON_VLANDRMPR_PCP_DEI_15_MASK)
/*! @} */

/*! @name IPFCAPR - Ingress port filter capability register */
/*! @{ */

#define ENETC_COMMON_IPFCAPR_RP_MASK             (0x1U)
#define ENETC_COMMON_IPFCAPR_RP_SHIFT            (0U)
#define ENETC_COMMON_IPFCAPR_RP_WIDTH            (1U)
#define ENETC_COMMON_IPFCAPR_RP(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFCAPR_RP_SHIFT)) & ENETC_COMMON_IPFCAPR_RP_MASK)

#define ENETC_COMMON_IPFCAPR_ISID_MASK           (0x2U)
#define ENETC_COMMON_IPFCAPR_ISID_SHIFT          (1U)
#define ENETC_COMMON_IPFCAPR_ISID_WIDTH          (1U)
#define ENETC_COMMON_IPFCAPR_ISID(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFCAPR_ISID_SHIFT)) & ENETC_COMMON_IPFCAPR_ISID_MASK)

#define ENETC_COMMON_IPFCAPR_FWD_SI_MASK         (0x4U)
#define ENETC_COMMON_IPFCAPR_FWD_SI_SHIFT        (2U)
#define ENETC_COMMON_IPFCAPR_FWD_SI_WIDTH        (1U)
#define ENETC_COMMON_IPFCAPR_FWD_SI(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFCAPR_FWD_SI_SHIFT)) & ENETC_COMMON_IPFCAPR_FWD_SI_MASK)

#define ENETC_COMMON_IPFCAPR_WOL_MASK            (0x8U)
#define ENETC_COMMON_IPFCAPR_WOL_SHIFT           (3U)
#define ENETC_COMMON_IPFCAPR_WOL_WIDTH           (1U)
#define ENETC_COMMON_IPFCAPR_WOL(x)              (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFCAPR_WOL_SHIFT)) & ENETC_COMMON_IPFCAPR_WOL_MASK)
/*! @} */

/*! @name IPFTCAPR - Ingress port filter table capability register */
/*! @{ */

#define ENETC_COMMON_IPFTCAPR_NUM_WORDS_MASK     (0xFFFFU)
#define ENETC_COMMON_IPFTCAPR_NUM_WORDS_SHIFT    (0U)
#define ENETC_COMMON_IPFTCAPR_NUM_WORDS_WIDTH    (16U)
#define ENETC_COMMON_IPFTCAPR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFTCAPR_NUM_WORDS_SHIFT)) & ENETC_COMMON_IPFTCAPR_NUM_WORDS_MASK)

#define ENETC_COMMON_IPFTCAPR_VERSIONS_MASK      (0xFFFF0000U)
#define ENETC_COMMON_IPFTCAPR_VERSIONS_SHIFT     (16U)
#define ENETC_COMMON_IPFTCAPR_VERSIONS_WIDTH     (16U)
#define ENETC_COMMON_IPFTCAPR_VERSIONS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFTCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_IPFTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name IPFTMOR - Ingress port filter table memory operational register */
/*! @{ */

#define ENETC_COMMON_IPFTMOR_NUM_WORDS_MASK      (0xFFFFU)
#define ENETC_COMMON_IPFTMOR_NUM_WORDS_SHIFT     (0U)
#define ENETC_COMMON_IPFTMOR_NUM_WORDS_WIDTH     (16U)
#define ENETC_COMMON_IPFTMOR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_IPFTMOR_NUM_WORDS_SHIFT)) & ENETC_COMMON_IPFTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name ITMCAPR - Index table memory capability register */
/*! @{ */

#define ENETC_COMMON_ITMCAPR_NUM_WORDS_MASK      (0xFFFFU)
#define ENETC_COMMON_ITMCAPR_NUM_WORDS_SHIFT     (0U)
#define ENETC_COMMON_ITMCAPR_NUM_WORDS_WIDTH     (16U)
#define ENETC_COMMON_ITMCAPR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ITMCAPR_NUM_WORDS_SHIFT)) & ENETC_COMMON_ITMCAPR_NUM_WORDS_MASK)

#define ENETC_COMMON_ITMCAPR_WORD_SIZE_MASK      (0x30000000U)
#define ENETC_COMMON_ITMCAPR_WORD_SIZE_SHIFT     (28U)
#define ENETC_COMMON_ITMCAPR_WORD_SIZE_WIDTH     (2U)
#define ENETC_COMMON_ITMCAPR_WORD_SIZE(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ITMCAPR_WORD_SIZE_SHIFT)) & ENETC_COMMON_ITMCAPR_WORD_SIZE_MASK)

#define ENETC_COMMON_ITMCAPR_MLOC_MASK           (0xC0000000U)
#define ENETC_COMMON_ITMCAPR_MLOC_SHIFT          (30U)
#define ENETC_COMMON_ITMCAPR_MLOC_WIDTH          (2U)
#define ENETC_COMMON_ITMCAPR_MLOC(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ITMCAPR_MLOC_SHIFT)) & ENETC_COMMON_ITMCAPR_MLOC_MASK)
/*! @} */

/*! @name RPCAPR - Rate policer capability register */
/*! @{ */

#define ENETC_COMMON_RPCAPR_TRTCM_MASK           (0x1U)
#define ENETC_COMMON_RPCAPR_TRTCM_SHIFT          (0U)
#define ENETC_COMMON_RPCAPR_TRTCM_WIDTH          (1U)
#define ENETC_COMMON_RPCAPR_TRTCM(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_RPCAPR_TRTCM_SHIFT)) & ENETC_COMMON_RPCAPR_TRTCM_MASK)

#define ENETC_COMMON_RPCAPR_CM_MASK              (0x2U)
#define ENETC_COMMON_RPCAPR_CM_SHIFT             (1U)
#define ENETC_COMMON_RPCAPR_CM_WIDTH             (1U)
#define ENETC_COMMON_RPCAPR_CM(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_RPCAPR_CM_SHIFT)) & ENETC_COMMON_RPCAPR_CM_MASK)
/*! @} */

/*! @name RPITCAPR - Rate policer index table capability register */
/*! @{ */

#define ENETC_COMMON_RPITCAPR_NUM_ENTRIES_MASK   (0xFFFFU)
#define ENETC_COMMON_RPITCAPR_NUM_ENTRIES_SHIFT  (0U)
#define ENETC_COMMON_RPITCAPR_NUM_ENTRIES_WIDTH  (16U)
#define ENETC_COMMON_RPITCAPR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_RPITCAPR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_RPITCAPR_NUM_ENTRIES_MASK)

#define ENETC_COMMON_RPITCAPR_VERSIONS_MASK      (0xFFFF0000U)
#define ENETC_COMMON_RPITCAPR_VERSIONS_SHIFT     (16U)
#define ENETC_COMMON_RPITCAPR_VERSIONS_WIDTH     (16U)
#define ENETC_COMMON_RPITCAPR_VERSIONS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_RPITCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_RPITCAPR_VERSIONS_MASK)
/*! @} */

