zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
/*! @name RPITMAR - Rate policer index table memory allocation register */
/*! @{ */

#define ENETC_COMMON_RPITMAR_NUM_WORDS_MASK      (0xFFFFU)
#define ENETC_COMMON_RPITMAR_NUM_WORDS_SHIFT     (0U)
#define ENETC_COMMON_RPITMAR_NUM_WORDS_WIDTH     (16U)
#define ENETC_COMMON_RPITMAR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_RPITMAR_NUM_WORDS_SHIFT)) & ENETC_COMMON_RPITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name RPITOR - Rate policer index table operational register */
/*! @{ */

#define ENETC_COMMON_RPITOR_NUM_ENTRIES_MASK     (0x3FFFU)
#define ENETC_COMMON_RPITOR_NUM_ENTRIES_SHIFT    (0U)
#define ENETC_COMMON_RPITOR_NUM_ENTRIES_WIDTH    (14U)
#define ENETC_COMMON_RPITOR_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_RPITOR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_RPITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISCITCAPR - Ingress stream counter index table capability register */
/*! @{ */

#define ENETC_COMMON_ISCITCAPR_NUM_ENTRIES_MASK  (0xFFFFU)
#define ENETC_COMMON_ISCITCAPR_NUM_ENTRIES_SHIFT (0U)
#define ENETC_COMMON_ISCITCAPR_NUM_ENTRIES_WIDTH (16U)
#define ENETC_COMMON_ISCITCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCITCAPR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_ISCITCAPR_NUM_ENTRIES_MASK)

#define ENETC_COMMON_ISCITCAPR_VERSIONS_MASK     (0xFFFF0000U)
#define ENETC_COMMON_ISCITCAPR_VERSIONS_SHIFT    (16U)
#define ENETC_COMMON_ISCITCAPR_VERSIONS_WIDTH    (16U)
#define ENETC_COMMON_ISCITCAPR_VERSIONS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCITCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_ISCITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISCITMAR - Ingress stream counter index table memory allocation register */
/*! @{ */

#define ENETC_COMMON_ISCITMAR_NUM_WORDS_MASK     (0xFFFFU)
#define ENETC_COMMON_ISCITMAR_NUM_WORDS_SHIFT    (0U)
#define ENETC_COMMON_ISCITMAR_NUM_WORDS_WIDTH    (16U)
#define ENETC_COMMON_ISCITMAR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCITMAR_NUM_WORDS_SHIFT)) & ENETC_COMMON_ISCITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISCITOR - Ingress stream counter index table operational register */
/*! @{ */

#define ENETC_COMMON_ISCITOR_NUM_ENTRIES_MASK    (0xFFFFU)
#define ENETC_COMMON_ISCITOR_NUM_ENTRIES_SHIFT   (0U)
#define ENETC_COMMON_ISCITOR_NUM_ENTRIES_WIDTH   (16U)
#define ENETC_COMMON_ISCITOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCITOR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_ISCITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name ISCAPR - Ingress stream capability register */
/*! @{ */

#define ENETC_COMMON_ISCAPR_SG_MASK              (0x8U)
#define ENETC_COMMON_ISCAPR_SG_SHIFT             (3U)
#define ENETC_COMMON_ISCAPR_SG_WIDTH             (1U)
#define ENETC_COMMON_ISCAPR_SG(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCAPR_SG_SHIFT)) & ENETC_COMMON_ISCAPR_SG_MASK)

#define ENETC_COMMON_ISCAPR_RP_MASK              (0x10U)
#define ENETC_COMMON_ISCAPR_RP_SHIFT             (4U)
#define ENETC_COMMON_ISCAPR_RP_WIDTH             (1U)
#define ENETC_COMMON_ISCAPR_RP(x)                (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCAPR_RP_SHIFT)) & ENETC_COMMON_ISCAPR_RP_MASK)

#define ENETC_COMMON_ISCAPR_MAXSDU_MASK          (0x20U)
#define ENETC_COMMON_ISCAPR_MAXSDU_SHIFT         (5U)
#define ENETC_COMMON_ISCAPR_MAXSDU_WIDTH         (1U)
#define ENETC_COMMON_ISCAPR_MAXSDU(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCAPR_MAXSDU_SHIFT)) & ENETC_COMMON_ISCAPR_MAXSDU_MASK)

#define ENETC_COMMON_ISCAPR_FWD_MASK             (0x200U)
#define ENETC_COMMON_ISCAPR_FWD_SHIFT            (9U)
#define ENETC_COMMON_ISCAPR_FWD_WIDTH            (1U)
#define ENETC_COMMON_ISCAPR_FWD(x)               (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISCAPR_FWD_SHIFT)) & ENETC_COMMON_ISCAPR_FWD_MASK)
/*! @} */

/*! @name ISITCAPR - Ingress stream index table capability register */
/*! @{ */

#define ENETC_COMMON_ISITCAPR_NUM_ENTRIES_MASK   (0xFFFFU)
#define ENETC_COMMON_ISITCAPR_NUM_ENTRIES_SHIFT  (0U)
#define ENETC_COMMON_ISITCAPR_NUM_ENTRIES_WIDTH  (16U)
#define ENETC_COMMON_ISITCAPR_NUM_ENTRIES(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISITCAPR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_ISITCAPR_NUM_ENTRIES_MASK)

#define ENETC_COMMON_ISITCAPR_VERSIONS_MASK      (0xFFFF0000U)
#define ENETC_COMMON_ISITCAPR_VERSIONS_SHIFT     (16U)
#define ENETC_COMMON_ISITCAPR_VERSIONS_WIDTH     (16U)
#define ENETC_COMMON_ISITCAPR_VERSIONS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISITCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_ISITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISITMAR - Ingress stream index table memory allocation register */
/*! @{ */

#define ENETC_COMMON_ISITMAR_NUM_WORDS_MASK      (0xFFFFU)
#define ENETC_COMMON_ISITMAR_NUM_WORDS_SHIFT     (0U)
#define ENETC_COMMON_ISITMAR_NUM_WORDS_WIDTH     (16U)
#define ENETC_COMMON_ISITMAR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISITMAR_NUM_WORDS_SHIFT)) & ENETC_COMMON_ISITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name ISITOR - Ingress stream index table operational register */
/*! @{ */

#define ENETC_COMMON_ISITOR_NUM_ENTRIES_MASK     (0xFFFFU)
#define ENETC_COMMON_ISITOR_NUM_ENTRIES_SHIFT    (0U)
#define ENETC_COMMON_ISITOR_NUM_ENTRIES_WIDTH    (16U)
#define ENETC_COMMON_ISITOR_NUM_ENTRIES(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISITOR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_ISITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name SGCAPR - Stream gate capability register */
/*! @{ */

#define ENETC_COMMON_SGCAPR_GLC_AO_MASK          (0x1U)
#define ENETC_COMMON_SGCAPR_GLC_AO_SHIFT         (0U)
#define ENETC_COMMON_SGCAPR_GLC_AO_WIDTH         (1U)
#define ENETC_COMMON_SGCAPR_GLC_AO(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCAPR_GLC_AO_SHIFT)) & ENETC_COMMON_SGCAPR_GLC_AO_MASK)

#define ENETC_COMMON_SGCAPR_GLC_GC_MASK          (0x2U)
#define ENETC_COMMON_SGCAPR_GLC_GC_SHIFT         (1U)
#define ENETC_COMMON_SGCAPR_GLC_GC_WIDTH         (1U)
#define ENETC_COMMON_SGCAPR_GLC_GC(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCAPR_GLC_GC_SHIFT)) & ENETC_COMMON_SGCAPR_GLC_GC_MASK)

#define ENETC_COMMON_SGCAPR_GLC_IO_MASK          (0x4U)
#define ENETC_COMMON_SGCAPR_GLC_IO_SHIFT         (2U)
#define ENETC_COMMON_SGCAPR_GLC_IO_WIDTH         (1U)
#define ENETC_COMMON_SGCAPR_GLC_IO(x)            (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCAPR_GLC_IO_SHIFT)) & ENETC_COMMON_SGCAPR_GLC_IO_MASK)

#define ENETC_COMMON_SGCAPR_GLC_IPV_MASK         (0x8U)
#define ENETC_COMMON_SGCAPR_GLC_IPV_SHIFT        (3U)
#define ENETC_COMMON_SGCAPR_GLC_IPV_WIDTH        (1U)
#define ENETC_COMMON_SGCAPR_GLC_IPV(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCAPR_GLC_IPV_SHIFT)) & ENETC_COMMON_SGCAPR_GLC_IPV_MASK)

#define ENETC_COMMON_SGCAPR_GLC_CTD_MASK         (0x10U)
#define ENETC_COMMON_SGCAPR_GLC_CTD_SHIFT        (4U)
#define ENETC_COMMON_SGCAPR_GLC_CTD_WIDTH        (1U)
#define ENETC_COMMON_SGCAPR_GLC_CTD(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCAPR_GLC_CTD_SHIFT)) & ENETC_COMMON_SGCAPR_GLC_CTD_MASK)
/*! @} */

/*! @name SGIITCAPR - Stream gate instance index table capability register */
/*! @{ */

#define ENETC_COMMON_SGIITCAPR_NUM_ENTRIES_MASK  (0xFFFFU)
#define ENETC_COMMON_SGIITCAPR_NUM_ENTRIES_SHIFT (0U)
#define ENETC_COMMON_SGIITCAPR_NUM_ENTRIES_WIDTH (16U)
#define ENETC_COMMON_SGIITCAPR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGIITCAPR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_SGIITCAPR_NUM_ENTRIES_MASK)

#define ENETC_COMMON_SGIITCAPR_VERSIONS_MASK     (0xFFFF0000U)
#define ENETC_COMMON_SGIITCAPR_VERSIONS_SHIFT    (16U)
#define ENETC_COMMON_SGIITCAPR_VERSIONS_WIDTH    (16U)
#define ENETC_COMMON_SGIITCAPR_VERSIONS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGIITCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_SGIITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SGIITMAR - Stream gate instance index table memory allocation register */
/*! @{ */

