zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_SGIITMAR_NUM_WORDS_MASK     (0xFFFFU)
#define ENETC_COMMON_SGIITMAR_NUM_WORDS_SHIFT    (0U)
#define ENETC_COMMON_SGIITMAR_NUM_WORDS_WIDTH    (16U)
#define ENETC_COMMON_SGIITMAR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGIITMAR_NUM_WORDS_SHIFT)) & ENETC_COMMON_SGIITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name SGIITOR - Stream gate instance index table operational register */
/*! @{ */

#define ENETC_COMMON_SGIITOR_NUM_ENTRIES_MASK    (0xFFFFU)
#define ENETC_COMMON_SGIITOR_NUM_ENTRIES_SHIFT   (0U)
#define ENETC_COMMON_SGIITOR_NUM_ENTRIES_WIDTH   (16U)
#define ENETC_COMMON_SGIITOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGIITOR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_SGIITOR_NUM_ENTRIES_MASK)
/*! @} */

/*! @name SGCLITCAPR - Stream gate control list index table capability register */
/*! @{ */

#define ENETC_COMMON_SGCLITCAPR_NUM_WORDS_MASK   (0xFFFFU)
#define ENETC_COMMON_SGCLITCAPR_NUM_WORDS_SHIFT  (0U)
#define ENETC_COMMON_SGCLITCAPR_NUM_WORDS_WIDTH  (16U)
#define ENETC_COMMON_SGCLITCAPR_NUM_WORDS(x)     (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCLITCAPR_NUM_WORDS_SHIFT)) & ENETC_COMMON_SGCLITCAPR_NUM_WORDS_MASK)

#define ENETC_COMMON_SGCLITCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define ENETC_COMMON_SGCLITCAPR_VERSIONS_SHIFT   (16U)
#define ENETC_COMMON_SGCLITCAPR_VERSIONS_WIDTH   (16U)
#define ENETC_COMMON_SGCLITCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCLITCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_SGCLITCAPR_VERSIONS_MASK)
/*! @} */

/*! @name SGCLITMAR - Stream gate control list index table memory allocation register */
/*! @{ */

#define ENETC_COMMON_SGCLITMAR_NUM_WORDS_MASK    (0xFFFFU)
#define ENETC_COMMON_SGCLITMAR_NUM_WORDS_SHIFT   (0U)
#define ENETC_COMMON_SGCLITMAR_NUM_WORDS_WIDTH   (16U)
#define ENETC_COMMON_SGCLITMAR_NUM_WORDS(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCLITMAR_NUM_WORDS_SHIFT)) & ENETC_COMMON_SGCLITMAR_NUM_WORDS_MASK)
/*! @} */

/*! @name SGCLTMOR - Stream gate control list table memory operational register */
/*! @{ */

#define ENETC_COMMON_SGCLTMOR_NUM_WORDS_MASK     (0xFFFFU)
#define ENETC_COMMON_SGCLTMOR_NUM_WORDS_SHIFT    (0U)
#define ENETC_COMMON_SGCLTMOR_NUM_WORDS_WIDTH    (16U)
#define ENETC_COMMON_SGCLTMOR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_SGCLTMOR_NUM_WORDS_SHIFT)) & ENETC_COMMON_SGCLTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name TGSTCAPR - Time gate scheduling table capability register */
/*! @{ */

#define ENETC_COMMON_TGSTCAPR_NUM_WORDS_MASK     (0xFFFFU)
#define ENETC_COMMON_TGSTCAPR_NUM_WORDS_SHIFT    (0U)
#define ENETC_COMMON_TGSTCAPR_NUM_WORDS_WIDTH    (16U)
#define ENETC_COMMON_TGSTCAPR_NUM_WORDS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_TGSTCAPR_NUM_WORDS_SHIFT)) & ENETC_COMMON_TGSTCAPR_NUM_WORDS_MASK)

#define ENETC_COMMON_TGSTCAPR_VERSIONS_MASK      (0xFFFF0000U)
#define ENETC_COMMON_TGSTCAPR_VERSIONS_SHIFT     (16U)
#define ENETC_COMMON_TGSTCAPR_VERSIONS_WIDTH     (16U)
#define ENETC_COMMON_TGSTCAPR_VERSIONS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_TGSTCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_TGSTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name TGSTMOR - Time gate scheduling table memory operation register */
/*! @{ */

#define ENETC_COMMON_TGSTMOR_NUM_WORDS_MASK      (0xFFFFU)
#define ENETC_COMMON_TGSTMOR_NUM_WORDS_SHIFT     (0U)
#define ENETC_COMMON_TGSTMOR_NUM_WORDS_WIDTH     (16U)
#define ENETC_COMMON_TGSTMOR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_TGSTMOR_NUM_WORDS_SHIFT)) & ENETC_COMMON_TGSTMOR_NUM_WORDS_MASK)
/*! @} */

/*! @name HTMCAPR - Hash table memory capability register */
/*! @{ */

#define ENETC_COMMON_HTMCAPR_NUM_WORDS_MASK      (0xFFFFU)
#define ENETC_COMMON_HTMCAPR_NUM_WORDS_SHIFT     (0U)
#define ENETC_COMMON_HTMCAPR_NUM_WORDS_WIDTH     (16U)
#define ENETC_COMMON_HTMCAPR_NUM_WORDS(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_HTMCAPR_NUM_WORDS_SHIFT)) & ENETC_COMMON_HTMCAPR_NUM_WORDS_MASK)

#define ENETC_COMMON_HTMCAPR_WORD_SIZE_MASK      (0x30000000U)
#define ENETC_COMMON_HTMCAPR_WORD_SIZE_SHIFT     (28U)
#define ENETC_COMMON_HTMCAPR_WORD_SIZE_WIDTH     (2U)
#define ENETC_COMMON_HTMCAPR_WORD_SIZE(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_HTMCAPR_WORD_SIZE_SHIFT)) & ENETC_COMMON_HTMCAPR_WORD_SIZE_MASK)

#define ENETC_COMMON_HTMCAPR_MLOC_MASK           (0xC0000000U)
#define ENETC_COMMON_HTMCAPR_MLOC_SHIFT          (30U)
#define ENETC_COMMON_HTMCAPR_MLOC_WIDTH          (2U)
#define ENETC_COMMON_HTMCAPR_MLOC(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_HTMCAPR_MLOC_SHIFT)) & ENETC_COMMON_HTMCAPR_MLOC_MASK)
/*! @} */

/*! @name HTMOR - Hash table memory operational register */
/*! @{ */

#define ENETC_COMMON_HTMOR_AMOUNT_MASK           (0xFFFFU)
#define ENETC_COMMON_HTMOR_AMOUNT_SHIFT          (0U)
#define ENETC_COMMON_HTMOR_AMOUNT_WIDTH          (16U)
#define ENETC_COMMON_HTMOR_AMOUNT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_HTMOR_AMOUNT_SHIFT)) & ENETC_COMMON_HTMOR_AMOUNT_MASK)

#define ENETC_COMMON_HTMOR_WATERMARK_MASK        (0xFFFF0000U)
#define ENETC_COMMON_HTMOR_WATERMARK_SHIFT       (16U)
#define ENETC_COMMON_HTMOR_WATERMARK_WIDTH       (16U)
#define ENETC_COMMON_HTMOR_WATERMARK(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_HTMOR_WATERMARK_SHIFT)) & ENETC_COMMON_HTMOR_WATERMARK_MASK)
/*! @} */

/*! @name ISIDCAPR - Ingress stream identification capability register */
/*! @{ */

#define ENETC_COMMON_ISIDCAPR_NUM_KC_MASK        (0x3U)
#define ENETC_COMMON_ISIDCAPR_NUM_KC_SHIFT       (0U)
#define ENETC_COMMON_ISIDCAPR_NUM_KC_WIDTH       (2U)
#define ENETC_COMMON_ISIDCAPR_NUM_KC(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDCAPR_NUM_KC_SHIFT)) & ENETC_COMMON_ISIDCAPR_NUM_KC_MASK)

#define ENETC_COMMON_ISIDCAPR_NUM_PF_MASK        (0x1CU)
#define ENETC_COMMON_ISIDCAPR_NUM_PF_SHIFT       (2U)
#define ENETC_COMMON_ISIDCAPR_NUM_PF_WIDTH       (3U)
#define ENETC_COMMON_ISIDCAPR_NUM_PF(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDCAPR_NUM_PF_SHIFT)) & ENETC_COMMON_ISIDCAPR_NUM_PF_MASK)

#define ENETC_COMMON_ISIDCAPR_MAX_KSIZE_MASK     (0x1F00U)
#define ENETC_COMMON_ISIDCAPR_MAX_KSIZE_SHIFT    (8U)
#define ENETC_COMMON_ISIDCAPR_MAX_KSIZE_WIDTH    (5U)
#define ENETC_COMMON_ISIDCAPR_MAX_KSIZE(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDCAPR_MAX_KSIZE_SHIFT)) & ENETC_COMMON_ISIDCAPR_MAX_KSIZE_MASK)

#define ENETC_COMMON_ISIDCAPR_UFT_MASK           (0x10000U)
#define ENETC_COMMON_ISIDCAPR_UFT_SHIFT          (16U)
#define ENETC_COMMON_ISIDCAPR_UFT_WIDTH          (1U)
#define ENETC_COMMON_ISIDCAPR_UFT(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDCAPR_UFT_SHIFT)) & ENETC_COMMON_ISIDCAPR_UFT_MASK)

#define ENETC_COMMON_ISIDCAPR_ETHFT_MASK         (0x20000U)
#define ENETC_COMMON_ISIDCAPR_ETHFT_SHIFT        (17U)
#define ENETC_COMMON_ISIDCAPR_ETHFT_WIDTH        (1U)
#define ENETC_COMMON_ISIDCAPR_ETHFT(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDCAPR_ETHFT_SHIFT)) & ENETC_COMMON_ISIDCAPR_ETHFT_MASK)
/*! @} */

/*! @name ISIDHTCAPR - Ingress stream identification hash table capability register */
/*! @{ */

#define ENETC_COMMON_ISIDHTCAPR_VERSIONS_MASK    (0xFFFF0000U)
#define ENETC_COMMON_ISIDHTCAPR_VERSIONS_SHIFT   (16U)
#define ENETC_COMMON_ISIDHTCAPR_VERSIONS_WIDTH   (16U)
#define ENETC_COMMON_ISIDHTCAPR_VERSIONS(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDHTCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_ISIDHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISIDKC0OR - Ingress stream identification key construction 0 operational register */
/*! @{ */

#define ENETC_COMMON_ISIDKC0OR_NUM_ENTRIES_MASK  (0xFFFFU)
#define ENETC_COMMON_ISIDKC0OR_NUM_ENTRIES_SHIFT (0U)
#define ENETC_COMMON_ISIDKC0OR_NUM_ENTRIES_WIDTH (16U)
#define ENETC_COMMON_ISIDKC0OR_NUM_ENTRIES(x)    (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0OR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_ISIDKC0OR_NUM_ENTRIES_MASK)

#define ENETC_COMMON_ISIDKC0OR_EN_MASK           (0x80000000U)
#define ENETC_COMMON_ISIDKC0OR_EN_SHIFT          (31U)
#define ENETC_COMMON_ISIDKC0OR_EN_WIDTH          (1U)
#define ENETC_COMMON_ISIDKC0OR_EN(x)             (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0OR_EN_SHIFT)) & ENETC_COMMON_ISIDKC0OR_EN_MASK)
/*! @} */

/*! @name ISIDKC0CR0 - Ingress stream identification key construction 0 configuration register 0 */
/*! @{ */

#define ENETC_COMMON_ISIDKC0CR0_VALID_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC0CR0_VALID_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC0CR0_VALID_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_VALID(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_VALID_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_VALID_MASK)

#define ENETC_COMMON_ISIDKC0CR0_PORTP_MASK       (0x2U)
#define ENETC_COMMON_ISIDKC0CR0_PORTP_SHIFT      (1U)
#define ENETC_COMMON_ISIDKC0CR0_PORTP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_PORTP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_PORTP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_PORTP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_SPMP_MASK        (0x4U)
#define ENETC_COMMON_ISIDKC0CR0_SPMP_SHIFT       (2U)
#define ENETC_COMMON_ISIDKC0CR0_SPMP_WIDTH       (1U)
#define ENETC_COMMON_ISIDKC0CR0_SPMP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_SPMP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_SPMP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_DMACP_MASK       (0x8U)
#define ENETC_COMMON_ISIDKC0CR0_DMACP_SHIFT      (3U)
#define ENETC_COMMON_ISIDKC0CR0_DMACP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_DMACP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_DMACP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_DMACP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_SMACP_MASK       (0x10U)
#define ENETC_COMMON_ISIDKC0CR0_SMACP_SHIFT      (4U)
#define ENETC_COMMON_ISIDKC0CR0_SMACP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_SMACP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_SMACP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_SMACP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_OVIDP_MASK       (0x20U)
#define ENETC_COMMON_ISIDKC0CR0_OVIDP_SHIFT      (5U)
#define ENETC_COMMON_ISIDKC0CR0_OVIDP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_OVIDP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_OVIDP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_OVIDP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_OPCPP_MASK       (0x40U)
#define ENETC_COMMON_ISIDKC0CR0_OPCPP_SHIFT      (6U)
#define ENETC_COMMON_ISIDKC0CR0_OPCPP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_OPCPP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_OPCPP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_OPCPP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_IVIDP_MASK       (0x80U)
#define ENETC_COMMON_ISIDKC0CR0_IVIDP_SHIFT      (7U)
#define ENETC_COMMON_ISIDKC0CR0_IVIDP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_IVIDP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_IVIDP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_IVIDP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_IPCPP_MASK       (0x100U)
#define ENETC_COMMON_ISIDKC0CR0_IPCPP_SHIFT      (8U)
#define ENETC_COMMON_ISIDKC0CR0_IPCPP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0CR0_IPCPP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_IPCPP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_IPCPP_MASK)

