zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_ISIDKC0CR0_SQTP_MASK        (0x200U)
#define ENETC_COMMON_ISIDKC0CR0_SQTP_SHIFT       (9U)
#define ENETC_COMMON_ISIDKC0CR0_SQTP_WIDTH       (1U)
#define ENETC_COMMON_ISIDKC0CR0_SQTP(x)          (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_SQTP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_SQTP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_ETP_MASK         (0x400U)
#define ENETC_COMMON_ISIDKC0CR0_ETP_SHIFT        (10U)
#define ENETC_COMMON_ISIDKC0CR0_ETP_WIDTH        (1U)
#define ENETC_COMMON_ISIDKC0CR0_ETP(x)           (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_ETP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_ETP_MASK)

#define ENETC_COMMON_ISIDKC0CR0_CTRLPP_MASK      (0x1000U)
#define ENETC_COMMON_ISIDKC0CR0_CTRLPP_SHIFT     (12U)
#define ENETC_COMMON_ISIDKC0CR0_CTRLPP_WIDTH     (1U)
#define ENETC_COMMON_ISIDKC0CR0_CTRLPP(x)        (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0CR0_CTRLPP_SHIFT)) & ENETC_COMMON_ISIDKC0CR0_CTRLPP_MASK)
/*! @} */

/*! @name ISIDKC0PF0CR - Ingress stream identification key construction 0 payload field 0 configuration register */
/*! @{ */

#define ENETC_COMMON_ISIDKC0PF0CR_PFP_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC0PF0CR_PFP_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC0PF0CR_PFP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0PF0CR_PFP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF0CR_PFP_SHIFT)) & ENETC_COMMON_ISIDKC0PF0CR_PFP_MASK)

#define ENETC_COMMON_ISIDKC0PF0CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC0PF0CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC0PF0CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC0PF0CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF0CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC0PF0CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC0PF0CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC0PF0CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC0PF0CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC0PF0CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF0CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC0PF0CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC0PF0CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC0PF0CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC0PF0CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC0PF0CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF0CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC0PF0CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC0PF0CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC0PF0CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC0PF0CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC0PF0CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF0CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC0PF0CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC0PF1CR - Ingress stream identification key construction 0 payload field 1 configuration register */
/*! @{ */

#define ENETC_COMMON_ISIDKC0PF1CR_PFP_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC0PF1CR_PFP_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC0PF1CR_PFP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0PF1CR_PFP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF1CR_PFP_SHIFT)) & ENETC_COMMON_ISIDKC0PF1CR_PFP_MASK)

#define ENETC_COMMON_ISIDKC0PF1CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC0PF1CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC0PF1CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC0PF1CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF1CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC0PF1CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC0PF1CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC0PF1CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC0PF1CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC0PF1CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF1CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC0PF1CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC0PF1CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC0PF1CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC0PF1CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC0PF1CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF1CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC0PF1CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC0PF1CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC0PF1CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC0PF1CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC0PF1CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF1CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC0PF1CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC0PF2CR - Ingress stream identification key construction 0 payload field 2 configuration register */
/*! @{ */

#define ENETC_COMMON_ISIDKC0PF2CR_PFP_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC0PF2CR_PFP_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC0PF2CR_PFP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC0PF2CR_PFP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF2CR_PFP_SHIFT)) & ENETC_COMMON_ISIDKC0PF2CR_PFP_MASK)

#define ENETC_COMMON_ISIDKC0PF2CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC0PF2CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC0PF2CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC0PF2CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF2CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC0PF2CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC0PF2CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC0PF2CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC0PF2CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC0PF2CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF2CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC0PF2CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC0PF2CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC0PF2CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC0PF2CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC0PF2CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF2CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC0PF2CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC0PF2CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC0PF2CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC0PF2CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC0PF2CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC0PF2CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC0PF2CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC0PF3CR - Ingress stream identification key construction 0 payload field 3 configuration register */
/*! @{ */

