zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_ENETC_COMMON.h
#define ENETC_COMMON_ISIDKC1PF0CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC1PF0CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC1PF0CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC1PF0CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF0CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC1PF0CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC1PF0CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC1PF0CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC1PF0CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC1PF0CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF0CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC1PF0CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC1PF0CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC1PF0CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC1PF0CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF0CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF0CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF0CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC1PF0CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC1PF0CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC1PF0CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF0CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF0CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF0CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC1PF1CR - Ingress stream identification key construction 1 payload field 1 configuration register */
/*! @{ */

#define ENETC_COMMON_ISIDKC1PF1CR_PFP_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC1PF1CR_PFP_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC1PF1CR_PFP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC1PF1CR_PFP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF1CR_PFP_SHIFT)) & ENETC_COMMON_ISIDKC1PF1CR_PFP_MASK)

#define ENETC_COMMON_ISIDKC1PF1CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC1PF1CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC1PF1CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC1PF1CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF1CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC1PF1CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC1PF1CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC1PF1CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC1PF1CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC1PF1CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF1CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC1PF1CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC1PF1CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC1PF1CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC1PF1CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF1CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF1CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF1CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC1PF1CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC1PF1CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC1PF1CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF1CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF1CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF1CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC1PF2CR - Ingress stream identification key construction 1 payload field 2 configuration register */
/*! @{ */

#define ENETC_COMMON_ISIDKC1PF2CR_PFP_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC1PF2CR_PFP_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC1PF2CR_PFP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC1PF2CR_PFP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF2CR_PFP_SHIFT)) & ENETC_COMMON_ISIDKC1PF2CR_PFP_MASK)

#define ENETC_COMMON_ISIDKC1PF2CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC1PF2CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC1PF2CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC1PF2CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF2CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC1PF2CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC1PF2CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC1PF2CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC1PF2CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC1PF2CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF2CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC1PF2CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC1PF2CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC1PF2CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC1PF2CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF2CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF2CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF2CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC1PF2CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC1PF2CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC1PF2CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF2CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF2CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF2CR_LBMASK_MASK)
/*! @} */

/*! @name ISIDKC1PF3CR - Ingress stream identification key construction 1 payload field 3 configuration register */
/*! @{ */

#define ENETC_COMMON_ISIDKC1PF3CR_PFP_MASK       (0x1U)
#define ENETC_COMMON_ISIDKC1PF3CR_PFP_SHIFT      (0U)
#define ENETC_COMMON_ISIDKC1PF3CR_PFP_WIDTH      (1U)
#define ENETC_COMMON_ISIDKC1PF3CR_PFP(x)         (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF3CR_PFP_SHIFT)) & ENETC_COMMON_ISIDKC1PF3CR_PFP_MASK)

#define ENETC_COMMON_ISIDKC1PF3CR_NUM_BYTES_MASK (0x1EU)
#define ENETC_COMMON_ISIDKC1PF3CR_NUM_BYTES_SHIFT (1U)
#define ENETC_COMMON_ISIDKC1PF3CR_NUM_BYTES_WIDTH (4U)
#define ENETC_COMMON_ISIDKC1PF3CR_NUM_BYTES(x)   (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF3CR_NUM_BYTES_SHIFT)) & ENETC_COMMON_ISIDKC1PF3CR_NUM_BYTES_MASK)

#define ENETC_COMMON_ISIDKC1PF3CR_BYTE_OFFSET_MASK (0x7F00U)
#define ENETC_COMMON_ISIDKC1PF3CR_BYTE_OFFSET_SHIFT (8U)
#define ENETC_COMMON_ISIDKC1PF3CR_BYTE_OFFSET_WIDTH (7U)
#define ENETC_COMMON_ISIDKC1PF3CR_BYTE_OFFSET(x) (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF3CR_BYTE_OFFSET_SHIFT)) & ENETC_COMMON_ISIDKC1PF3CR_BYTE_OFFSET_MASK)

#define ENETC_COMMON_ISIDKC1PF3CR_FBMASK_MASK    (0x70000U)
#define ENETC_COMMON_ISIDKC1PF3CR_FBMASK_SHIFT   (16U)
#define ENETC_COMMON_ISIDKC1PF3CR_FBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF3CR_FBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF3CR_FBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF3CR_FBMASK_MASK)

#define ENETC_COMMON_ISIDKC1PF3CR_LBMASK_MASK    (0x700000U)
#define ENETC_COMMON_ISIDKC1PF3CR_LBMASK_SHIFT   (20U)
#define ENETC_COMMON_ISIDKC1PF3CR_LBMASK_WIDTH   (3U)
#define ENETC_COMMON_ISIDKC1PF3CR_LBMASK(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISIDKC1PF3CR_LBMASK_SHIFT)) & ENETC_COMMON_ISIDKC1PF3CR_LBMASK_MASK)
/*! @} */

/*! @name ISFHTCAPR - Ingress stream filter hash table capability register */
/*! @{ */

#define ENETC_COMMON_ISFHTCAPR_VERSIONS_MASK     (0xFFFF0000U)
#define ENETC_COMMON_ISFHTCAPR_VERSIONS_SHIFT    (16U)
#define ENETC_COMMON_ISFHTCAPR_VERSIONS_WIDTH    (16U)
#define ENETC_COMMON_ISFHTCAPR_VERSIONS(x)       (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISFHTCAPR_VERSIONS_SHIFT)) & ENETC_COMMON_ISFHTCAPR_VERSIONS_MASK)
/*! @} */

/*! @name ISFHTOR - Ingress stream filter hash table operational register */
/*! @{ */

#define ENETC_COMMON_ISFHTOR_NUM_ENTRIES_MASK    (0xFFFFU)
#define ENETC_COMMON_ISFHTOR_NUM_ENTRIES_SHIFT   (0U)
#define ENETC_COMMON_ISFHTOR_NUM_ENTRIES_WIDTH   (16U)
#define ENETC_COMMON_ISFHTOR_NUM_ENTRIES(x)      (((uint32_t)(((uint32_t)(x)) << ENETC_COMMON_ISFHTOR_NUM_ENTRIES_SHIFT)) & ENETC_COMMON_ISFHTOR_NUM_ENTRIES_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group ENETC_COMMON_Register_Masks */

/*!
 * @}
 */ /* end of group ENETC_COMMON_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_ENETC_COMMON_H_) */
